back/crm/app/Http/Controllers/AgendaController.php

    public function index()
    {
        $agenda = Agenda::all();
---
select * from `agendas`