back/crm/app/Http/Controllers/ContactController.php

    public function index()
    {
        $contacts = Contact::all();
---
select * from `contacts`

    public function create()
    {
        $pays = Pays::all();
        $qualites = QualiteRelation::all();
        $etats = EtatRelation::all();
        $secteurs = Secteur::all();
        $groupes = Groupe::all();
---
select * from `pays`
select * from `etat_relations`
select * from `qualite_relations`
select * from `secteurs`
select * from `groupes`

    public function store(Request $request)
    {
        $contact = new Contact();
        $contact->entreprise = $request->input('entreprise');
        $contact->contact = $request->input('contact');
        $contact->fonction = $request->input('fonction');
        $contact->civilite = $request->input('civilite');
        $contact->fax = $request->input('fax');
        $contact->mail = $request->input('email');
        $contact->web = $request->input('web');
        $contact->adresse = $request->input('adresse');
        $contact->ville = $request->input('ville');
        $contact->cp = $request->input('cp');
        $contact->fix = $request->input('fix');
        $contact->mobile = $request->input('mobile');
        $contact->surveillance = $request->input('surveillance');
        $contact->secteur_id = $request->input('secteur');
        $contact->groupe_id = $request->input('groupe');
        $contact->pays_id = $request->input('pays');
        $contact->qualite_relation_id = $request->input('qualite');
        $contact->etat_relation_id = $request->input('relation');

        $contact->save();
---
insert into `contacts` (`entreprise`, `contact`, `fonction`, `civilite`, `fax`, `mail`, `web`, `adresse`, `ville`, `cp`, `fix`, `mobile`, `surveillance`, `secteur_id`, `groupe_id`, `pays_id`, `qualite_relation_id`, `etat_relation_id`, `updated_at`, `created_at`) values ('jijio', 'iojiojio', 'jiojio', 'homme', 'jiojio', 'popopj@gmail.com', 'fzefze', 'huoihjouhjo', 'ioiohjoi', 'jioioijo', 'iohioho', 'hoiohoi', '1', '1', '1', '1', '1', '1', '2019-06-02 13:29:22', '2019-06-02 13:29:22')